{"pages":[{"title":"Installing Drupal","text":"Due to the complexity of the features and functionalities of the theme, we recommend you to start with a new fresh Drupal installation. To enable quick and easy setup, TheMAG comes with an installation profile which combines the core Drupal, contributed modules, TheMAG theme, and the pre-defined configurations. Step 1: Copy the entire content from the â\u0080\u009cthemag_drupal_instalationâ\u0080\u009d to the location on your web server where you want your site to be accessed. Make sure that you have copied all files including the hidden files, especially .htaccess file. Without .htaccess you will face a problem with clean urls. Step 2: Run Drupal Installation. Go to http:\/\/example.com\/install.php. If you installed Drupal in a subfolder, you should point your browser to the subfolder (for example, http:\/\/example.com\/subfolder). Step 3: Choose TheMAG installation profile and click on â\u0080\u009cSave and Continueâ\u0080\u009d. Step 4: If you see this message during installation process: You need to create a setting.php file. Drupal comes with a default.settings.php file from which you need to make a copy, rename it to settings.php. cp sites\/default\/default.settings.php sites\/default\/settings.php Step 5: Give write permission to setting.php file: chmod 777 sites\/default\/settings.phpâ\u0080¨` Step 6: Give Drupal permission to write in sites\/default\/files folder. chmod -R 777 sites\/default\/files\/ Step 7: Refresh the page or click on the &quot;proceed with the installation&quot; link. You can find more detail about the Drupal installation process at drupal.org:â\u0080¨ Installing Drupal 7: â\u0080¨https:\/\/www.drupal.org\/docs\/7\/install Creating the database: â\u0080¨https:\/\/www.drupal.org\/docs\/7\/installing-drupal-7\/step-2-create-the-database Create settings.php: https:\/\/www.drupal.org\/docs\/7\/installing-drupal-7\/step-3-create-settingsphp-and-the-files-directory Run the installation script: https:\/\/www.drupal.org\/docs\/7\/installing-drupal-7\/step-4-run-the-installation-script","tags":"","url":"Installing_Drupal.html"},{"title":"Creating Article","text":"To create article go to: Content &gt; Add Content &gt; TheMAG Article. This content type is divided into four sections: - Teaser - Content - Categorization - Settings Teaser Section: The Teaser section contains teaser image and summary field. The content of those fields is automatically displayed in the article teaser which is generated by the views module. Content Section: This section is representing the main content of the article. In order to give more editing power, we use the Paragraph module. Instead of putting all the content in one WYSIWYG body field including images and videos, you can choose between predefined paragraph types independent from one another. Currently there are six predefined paragraph types: Image, Video, Embed Video, Gallery Grid, Gallery Slider and Text &amp; HTML. You can edit existing paragraph types or defined new bundles in the Structure &gt; Paragraph Bundles. For more about Paragraphs, see module page: https:\/\/www.drupal.org\/project\/paragraphs Categorization: In this section you can add various meta-information to each post you create. Categories, tags, and post type (post icon). Categories are predefined taxonomies which are used to sort content into different sections. TheMAG comes without predefined categories. So, if you start using TheMAG without demo content, you will need to create some categories before you start creating content. To create category (term), go to: Structure &gt; Taxonomy &gt; Categories and then click on Add term. Settings Section: In this section you can use Post options to include or exclude teaser image from the main content, or to mark post as featured. Also you can use Post layout drop-down menu and choose post layout style for each post you create.","tags":"","url":"Creating_Article.html"},{"title":"Importing Demo Content","text":"The simplest way to start using this theme and to understand its possibilities and functionalities, is to start with the demo content. In order to import the demo content, make the following steps: Step 1: Go to Configuration &gt; System &gt; Backup and Migrate &gt; Restore Step 2: Choose the demo you wish to import from the &quot;themag_demo_content&quot; folder. Step 3: Click on Restore now. Important note: Do not import demo content on the site with existing content. All of your existing data will be lost.","tags":"","url":"Importing_Demo_Content.html"},{"title":"Menus","text":"TheMAG contains four menu regions. Main Menu â\u0080\u0093 This menu supports multilevel submenus. Social Menu â\u0080\u0093 Menu with links to social networks User Menu â\u0080\u0093 Menu that contains links related to user action (Login, Search, etc.) Footer Menu Adding a new link to the menu: Step 1: Go to Structure &gt; Menu Step 2: Click on add link on the menu where you want to add a new link Step 3: Enter Menu link title and a path for the link. In addition to text, the menu link title field also supports HTML.For an example, if you wish to use Font Awesome in order to create a link with an icon and text, you can do the following:â\u0080¨â\u0080¨ &lt;i class=&quot;fa fa-user&quot; aria-hidden=&quot;true&quot;&gt;&lt;\/i&gt; User Accountâ\u0080¨ Step 4: The main menu supports several levels of submenus. If you wish to position the link in a submenu, use the Parent link drop-down list to choose link depth. When you add links to the main menu, always use the option Show as expanded to enable access to the deeper layers of the menu in the responsive navigation. Step 5:. In the end, click Save Theme Settings This theme contains advanced settings through which you can easily make a change of the menus Step 1: Go to Appearance &gt; Settings &gt; TheMAG Step 2: Click on the tab Header if you wish to make changes to the menus contained by the header, or click on the tab Footer if you wish to change the footer menu. Unlike the &quot;Main Menu&quot; and &quot;Footer Menu&quot;, in the &quot;Social Links&quot; and &quot;User Action Links menu&quot; you can also use custom HTML to create links in the menu. Step 3: To save changes, click on Save configuration.","tags":"","url":"Menus.html"},{"title":"Managing Pages and Content","text":"TheMAG contains: 8 page layouts 4 &quot;Featured Posts&quot; layout styles 13 &quot;Teaser&quot; layout styles Instead of the standard Drupal Block module, TheMAG uses Panels and Page Manager module for content and layout management. By using these modules you can create unlimited number of page variants and layout combinations. Available Page Layouts Available Featured Posts Layouts Available Teaser Layouts","tags":"","url":"Managing_Pages_and_Content\/index.html"},{"title":"Creating Lists of Content Items","text":"Step 1: Go to the page where you would like to add a new list of content items (for example, Front Page). Step 2: Click on the Customize this page button located on the bottom of the page. Step 3: In the region where you would like to add the list, click the &quot;Add new pane&quot; button. Step 4: From the left side of the popup window, click the tab TheMAG Teasers and then choose which teaser style you would like to use for the list. For an example, choose Teaser Layout (B). Step 5: Enter a title of the list (for example, Latest Posts), number of posts (for example 3) and choose a category. If you do not choose a category, all the content from all categories will be chronologically displayed in the list. Step 6: Click Finish List Format and Teaser Layout Style The next thing you should do is to choose a list format and teaser layout style. TheMAG contains already predefined CSS classes which you can use in order to determine the format and the style of the list (see the table at the bottom of this page). Of course, you can also define your custom CSS classes and styles in order to create new or to modify the existing formats and styles. Step 1:. Click the CSS button. Step 2: In the field CSS class add the CSS classes which will define the format of the list or the style of the teaser. For example: mg-teaser--3-col-grid. and your items list will look like this: or use the mg-teaser--3-col-grid mg-teaser--compact classes and your list will look like this: Step 3: At the end click the Save button on the bottom of the page. Table of CSS Classes for the Lists Format CSS Class Teaser Layout (A) Teaser Layout (B) Teaser Layout (C) Teaser Layout (D) Teaser Layout (E) Teaser Layout (F) mg-teaser--list mg-teaser--2-col-grid mg-teaser--3-col-grid mg-teaser--4-col-grid Table of CSS Classes for the Teaser Layout Style CSS Class Teaser Layout (A) Teaser Layout (B) Teaser Layout (C) Teaser Layout (D) Teaser Layout (E) Teaser Layout (F) mg-teaser--compact mg-teaser--card","tags":"","url":"Managing_Pages_and_Content\/Creating_Lists_of_Content_Items.html"},{"title":"Combining Teaser Layouts","text":"By combining different teaser layouts and their format, you can create more complex and more interesting lists of content items. For example: Step 1: Go to Structure &gt; Mini Panels Step 2: Click Add â\u0080¨ Step 3: Enter Administrative title and Administrative description (Example: Latest Posts) and click Continue. Step 4: Click Continue tp skip Context section, unless you know what you are doing. Step 5: Choose Layout and click Continue. In this example I will choose 3 Column layout.â\u0080¨ Step 6: Click on the settings icon in order to add content. Step 7: In the first column add one item of the Teaser Layout (B), in the second column add two items of the Teaser Layout (D) and in the third column, once again add Teaser Layout (B). Step 8: Determine the list format and the teaser style by adding CSS classes to the pane (see the table of CSS classes).â\u0080¨ Step 9: Click Finish. Using Mini Panel Now the &quot;Latest Posts&quot; mini panel is created and ready for use. In order to use this panel, make the following steps: Step 1: Go to the page where you would like to add this panel. Step 2: Click the Customize this page button located on the bottom of the page. Step 3: In the region where you would like to add the panel, click the &quot;Add new pane&quot; button. Step 4: From the left side of the popup window, click the tab Mini panel and then choose the &quot;Latest Posts&quot;. Step 5: Click Finish and then Save on the page bottom.","tags":"","url":"Managing_Pages_and_Content\/Combining_Teaser_Layouts.html"},{"title":"Front Page","text":"TheMAG contains four predefined variants of front page. If you wish to use some of the them, perform the following steps: Step 1: Go to Structure &gt; Pages. Step 2: Click on Edit to make changes. Home Page 1 is a default variant of the front page. In order to change it and use another variant, for example Home Page 2, perform the following steps: Step 1: Click the Home Page 2 tab from the left side and choose Selection rules. Step 2: Click the Remove button in order to remove the â\u0080\u009cString: comparisonâ\u0080\u009d rule. This rule is created only for the purposes of the demo content.â\u0080¨ Step 3: Click the Update and Save button. Step 4: Now click the Home Page 1 tab from the left side and choose Summary. What we should do is disable the (Home Page 1) default variant because at the same time there cannot be several active variants of the front page. Step 5: Click Disable to disable this option. Step 6: Click the Disable and Save button.","tags":"","url":"Managing_Pages_and_Content\/Front_Page.html"},{"title":" Category Page (Taxonomy Term Page)","text":"Just like the front page, TheMAG contains several predefined variants of taxonomy term pages. To use some of the predefined variants, do the following: Step 1: Go to Structure &gt; Pages. Step 2: Click Edit to make changes. â\u0080¨ Step 3: Click the tab of the varian you would like to use and select Selection rules. Step 4: Remove the rule â\u0080\u009cPHP Codeâ\u0080\u009dâ\u0080¨ Step 5: Disable the options you do not use.","tags":"","url":"Managing_Pages_and_Content\/ Category_Page_(Taxonomy_Term_Page).html"},{"title":"Advertisement Management","text":"Using the Panels module you can add a banner on any page in any region. What you should consider is that TheMAG is a responsive template and that the placing of a non-responsive banner may impair the appearance of the theme on smaller devices. To add a banner: Step 1: Go to the page where you wish to place the banner. Step 2: Click the Customize this page button located on the bottom of the page. Step 3: In the region where you wish to add the banner, click to plus button. Step 4: Click the New custom content link located on the left side of the popup window. Step 5: Fill out the field Administrative title Step 6: Put the banner in the Body field. Step 7: Click Finish. Step 8: Click the CSS button. Step 9: Put the banner class In the CSS class field. If you wish to create a sticky banner just like in the demo, add the stick-in-parent class beside the banner class in the CSS field. So you've got two css classes in the CSS class field. Note: You can use the &quot;stick-in-parent&quot; class on any element in order to make it sticky.","tags":"","url":"Advertisement_Management.html"},{"title":"Theme Settings","text":"TheMAG contains several advanced settings for the theme customization. Go to: Appearance &gt; Settings &gt; TheMAG to configure your theme's settings. You can change color of your theme, add your own logo, custom CSS and JavaScript, etc.","tags":"","url":"Theme_Settings.html"},{"title":"Theme Customization","text":"If you plan to customize the theme, we recommend you to create a sub-theme instead of modifying the original styles and template files. To create a sub-theme use the SUBTHEMEKIT theme located in the sites\/all\/themes\/themag template folder. You can use this sub-theme to make customizations to the style and template structure of the parent (TheMAG) theme without having to modify the parent theme itself. Make a copy of the SUBTHEMEKIT folder outside the themag template folder. The location of your sub-theme should be: sites\/all\/themes\/SUBTHEMEKIT. Rename the SUBTHEMEKIT.info.txt file located in the SUBTHEMEKIT folder in SUBTHEMEKIT.info Go to Appearance. Click on Enable and set default on the TheMAG Sub-theme in order to activate it. Build tools TheMAG comes with SCSS files and uses Gulp for its CSS and JavaScript build system, and Bower for package management. To compile SCSS using Gulp: Download and install Node In your terminal navigate to the sites\/all\/themes\/SUBTHEMEKIT directory and run npm install to install the dependencies listed in package.json file. Run gulp to install the components. Run gulp watch. Now all changes made in the SUBTHEMEKIT\/assets\/scss\/subtheme.scss file, will be automatically compiled in SUBTHEMEKIT\/assets\/css\/subtheme.css.","tags":"","url":"Theme_Customization.html"},{"title":"Files & Sources","text":"TheMAG uses the following plug-ins: Waypoints - http:\/\/imakewebthings.com\/waypoints Sticky Kit - https:\/\/github.com\/leafo\/sticky-kit Smooth Scroll - https:\/\/github.com\/cferdinandi\/smooth-scroll PhotoSwipe - http:\/\/photoswipe.com Parallax.js - http:\/\/pixelcog.github.io\/parallax.js Sidr - https:\/\/www.berriart.com\/sidr Video.js - http:\/\/videojs.com Owl Carousel - https:\/\/owlcarousel2.github.io\/OwlCarousel2 RRSSB - https:\/\/github.com\/kni-labs\/rrssb Superfish - http:\/\/users.tpg.com.au\/j_birch\/plugins\/superfish Spectrumv - https:\/\/github.com\/bgrins\/spectrum All of these plug-ins are located in sites\/all\/libraries and sites\/all\/themes\/themag\/assets\/vendor.","tags":"","url":"Files_&_Sources.html"},{"title":"Thank You","text":"Again, thank you for purchasing TheMAG! If you have any questions or feedback please contact us at support@pinkdexo.com","tags":"","url":"Thank_You.html"}]}